{
  "101,32": 256,
  "32,32": 257,
  "32,116": 258,
  "32,97": 259,
  "258,104": 260,
  "105,110": 261,
  "116,32": 262,
  "101,114": 263,
  "100,32": 264,
  "111,117": 265,
  "32,115": 266,
  "260,256": 267,
  "257,257": 268,
  "111,110": 269,
  "44,32": 270,
  "116,104": 271,
  "261,103": 272,
  "115,32": 273,
  "101,110": 274,
  "10,10": 275,
  "259,110": 276,
  "108,105": 277,
  "101,97": 278,
  "111,32": 279,
  "275,257": 280,
  "104,97": 281,
  "104,256": 282,
  "111,114": 283,
  "108,108": 284,
  "121,32": 285,
  "97,110": 286,
  "111,102": 287,
  "105,116": 288,
  "101,100": 289,
  "119,97": 290,
  "97,105": 291,
  "111,119": 292,
  "280,96": 293,
  "101,115": 294,
  "104,263": 295,
  "121,265": 296,
  "44,276": 297,
  "272,32": 298,
  "268,268": 299,
  "277,99": 300,
  "44,39": 301,
  "259,32": 302,
  "65,300": 303,
  "99,104": 304,
  "115,101": 305,
  "97,114": 306,
  "97,116": 307,
  "258,279": 308,
  "266,291": 309,
  "105,115": 310,
  "101,264": 311,
  "260,101": 312,
  "118,263": 313,
  "117,114": 314,
  "111,111": 315,
  "105,262": 316,
  "98,101": 317,
  "103,104": 318,
  "46,257": 319,
  "100,267": 320,
  "33,39": 321,
  "73,32": 322,
  "116,108": 323,
  "46,293": 324,
  "297,264": 325,
  "266,282": 326,
  "45,45": 327,
  "115,116": 328,
  "111,109": 329,
  "258,111": 330,
  "119,105": 331,
  "119,104": 332,
  "114,101": 333,
  "284,32": 334,
  "110,111": 335,
  "287,32": 336,
  "97,262": 337,
  "265,108": 338,
  "303,256": 339,
  "102,283": 340,
  "301,309": 341,
  "108,121": 342,
  "116,263": 343,
  "115,282": 344,
  "331,271": 345,
  "105,109": 346,
  "114,105": 347,
  "296,32": 348,
  "101,10": 349,
  "278,114": 350,
  "256,271": 351,
  "117,115": 352,
  "290,115": 353,
  "58,257": 354,
  "117,112": 355,
  "46,39": 356,
  "44,10": 357,
  "107,32": 358,
  "270,96": 359,
  "290,273": 360,
  "274,32": 361,
  "117,116": 362,
  "303,101": 363,
  "105,114": 364,
  "114,278": 365,
  "105,273": 366,
  "39,262": 367,
  "101,101": 368,
  "271,263": 369,
  "118,256": 370,
  "63,39": 371,
  "108,97": 372,
  "102,32": 373,
  "338,264": 374,
  "256,116": 375,
  "110,292": 376,
  "269,32": 377,
  "265,318": 378,
  "105,100": 379,
  "259,115": 380,
  "116,323": 381,
  "117,262": 382,
  "105,99": 383,
  "276,264": 384,
  "295,32": 385,
  "117,304": 386,
  "260,337": 387,
  "108,101": 388,
  "103,101": 389,
  "315,107": 390,
  "109,97": 391,
  "73,39": 392,
  "292,110": 393,
  "100,10": 394,
  "319,96": 395,
  "265,262": 396,
  "117,110": 397,
  "341,320": 398,
  "256,97": 399,
  "281,264": 400,
  "305,108": 401,
  "113,117": 402,
  "277,381": 403,
  "103,97": 404,
  "101,313": 405,
  "312,10": 406,
  "108,285": 407,
  "261,32": 408,
  "265,116": 409,
  "103,111": 410,
  "100,111": 411,
  "99,97": 412,
  "46,280": 413,
  "274,116": 414,
  "259,116": 415,
  "114,97": 416,
  "39,273": 417,
  "256,115": 418,
  "286,264": 419,
  "114,121": 420,
  "287,267": 421,
  "265,110": 422,
  "356,293": 423,
  "112,111": 424,
  "84,282": 425,
  "10,271": 426,
  "266,104": 427,
  "317,103": 428,
  "97,108": 429,
  "114,111": 430,
  "100,105": 431,
  "33,257": 432,
  "259,273": 433,
  "299,299": 434,
  "97,98": 435,
  "100,393": 436,
  "274,262": 437,
  "119,263": 438,
  "265,115": 439,
  "101,120": 440,
  "281,262": 441,
  "105,108": 442,
  "277,107": 443,
  "294,115": 444,
  "116,111": 445,
  "108,390": 446,
  "107,376": 447,
  "109,32": 448,
  "97,99": 449,
  "59,32": 450,
  "268,257": 451,
  "100,263": 452,
  "259,98": 453,
  "265,114": 454,
  "87,104": 455,
  "269,256": 456,
  "32,109": 457,
  "404,261": 458,
  "115,291": 459,
  "105,269": 460,
  "264,363": 461,
  "101,273": 462,
  "403,256": 463,
  "98,382": 464,
  "112,112": 465,
  "313,285": 466,
  "401,102": 467,
  "117,101": 468,
  "105,318": 469,
  "32,99": 470,
  "97,121": 471,
  "100,260": 472,
  "281,110": 473,
  "259,284": 474,
  "101,108": 475,
  "335,116": 476,
  "304,32": 477,
  "39,115": 478,
  "99,101": 479,
  "111,108": 480,
  "101,99": 481,
  "101,121": 482,
  "32,104": 483,
  "269,103": 484,
  "65,110": 485,
  "98,256": 486,
  "105,284": 487,
  "81,468": 488,
  "270,332": 489,
  "111,369": 490,
  "281,116": 491,
  "111,99": 492,
  "10,115": 493,
  "115,262": 494,
  "286,32": 495,
  "101,109": 496,
  "109,256": 497,
  "259,262": 498,
  "44,266": 499,
  "335,262": 500,
  "307,343": 501,
  "117,108": 502,
  "260,307": 503,
  "98,111": 504,
  "287,102": 505,
  "292,32": 506,
  "329,256": 507,
  "101,284": 508,
  "101,116": 509,
  "103,114": 510,
  "100,269": 511,
  "84,104": 512,
  "108,278": 513,
  "119,437": 514,
  "110,367": 515,
  "289,267": 516,
  "352,262": 517,
  "310,104": 518,
  "351,256": 519,
  "296,114": 520,
  "333,109": 521,
  "321,309": 522,
  "119,374": 523,
  "283,32": 524,
  "288,256": 525,
  "261,267": 526,
  "281,370": 527,
  "259,334": 528,
  "98,362": 529,
  "259,458": 530,
  "261,302": 531,
  "104,278": 532,
  "84,314": 533,
  "115,104": 534,
  "312,285": 535,
  "101,270": 536,
  "354,96": 537,
  "119,283": 538,
  "290,121": 539,
  "32,42": 540,
  "261,107": 541,
  "295,467": 542,
  "105,373": 543,
  "259,114": 544,
  "533,323": 545,
  "119,441": 546,
  "115,256": 547,
  "112,263": 548,
  "330,266": 549,
  "492,358": 550,
  "46,10": 551,
  "39,116": 552,
  "109,283": 553,
  "112,104": 554,
  "301,267": 555,
  "116,279": 556,
  "10,97": 557,
  "294,116": 558,
  "297,100": 559,
  "345,32": 560,
  "261,100": 561,
  "258,346": 562,
  "450,96": 563,
  "333,112": 564,
  "488,274": 565,
  "72,501": 566,
  "71,420": 567,
  "567,554": 568,
  "272,308": 569,
  "108,111": 570,
  "289,308": 571,
  "119,269": 572,
  "102,114": 573,
  "99,374": 574,
  "265,305": 575,
  "347,318": 576,
  "341,461": 577,
  "118,111": 578,
  "77,550": 579,
  "579,545": 580,
  "111,112": 581,
  "266,111": 582,
  "100,100": 583,
  "438,256": 584,
  "459,100": 585,
  "485,264": 586,
  "109,386": 587,
  "330,267": 588,
  "312,109": 589,
  "540,451": 590,
  "269,101": 591,
  "89,265": 592,
  "378,116": 593,
  "107,256": 594,
  "578,383": 595,
  "75,272": 596,
  "313,121": 597,
  "368,112": 598,
  "260,310": 599,
  "375,279": 600,
  "105,102": 601,
  "100,115": 602,
  "108,306": 603,
  "101,334": 604,
  "271,298": 605,
  "117,109": 606,
  "263,32": 607,
  "378,262": 608,
  "99,269": 609,
  "340,32": 610,
  "327,39": 611,
  "104,366": 612,
  "67,307": 613,
  "338,100": 614,
  "271,272": 615,
  "415,267": 616,
  "44,326": 617,
  "103,256": 618,
  "323,121": 619,
  "108,484": 620,
  "301,32": 621,
  "82,435": 622,
  "622,98": 623,
  "99,256": 624,
  "261,445": 625,
  "295,256": 626,
  "104,350": 627,
  "102,343": 628,
  "314,110": 629,
  "453,396": 630,
  "115,97": 631,
  "422,100": 632,
  "321,293": 633,
  "111,313": 634,
  "102,364": 635,
  "112,372": 636,
  "84,72": 637,
  "389,116": 638,
  "110,405": 639,
  "312,364": 640,
  "288,273": 641,
  "99,454": 642,
  "283,109": 643,
  "380,326": 644,
  "431,264": 645,
  "117,328": 646,
  "356,280": 647,
  "590,590": 648,
  "68,386": 649,
  "568,269": 650,
  "391,100": 651,
  "112,97": 652,
  "101,118": 653,
  "260,263": 654,
  "110,279": 655,
  "281,100": 656,
  "69,82": 657,
  "116,298": 658,
  "107,272": 659,
  "259,10": 660,
  "428,286": 661,
  "289,10": 662,
  "371,309": 663,
  "263,112": 664,
  "68,643": 665,
  "102,368": 666,
  "426,256": 667,
  "79,85": 668,
  "375,111": 669,
  "103,365": 670,
  "329,101": 671,
  "98,121": 672,
  "453,409": 673,
  "270,348": 674,
  "98,449": 675,
  "286,100": 676,
  "511,367": 677,
  "104,346": 678,
  "371,293": 679,
  "98,108": 680,
  "115,115": 681,
  "290,285": 682,
  "105,439": 683,
  "649,444": 684,
  "77,306": 685,
  "330,10": 686,
  "116,97": 687,
  "422,264": 688,
  "297,394": 689,
  "119,491": 690,
  "295,101": 691,
  "100,279": 692,
  "399,32": 693,
  "73,262": 694,
  "321,280": 695,
  "522,320": 696,
  "306,107": 697,
  "317,340": 698,
  "401,373": 699,
  "109,517": 700,
  "39,114": 701,
  "306,100": 702,
  "258,97": 703,
  "281,114": 704,
  "99,286": 705,
  "520,32": 706,
  "365,100": 707,
  "108,32": 708,
  "79,104": 709,
  "73,266": 710,
  "276,100": 711,
  "316,353": 712,
  "101,285": 713,
  "258,119": 714,
  "439,256": 715,
  "315,358": 716,
  "261,358": 717,
  "436,32": 718,
  "99,329": 719,
  "573,329": 720,
  "32,336": 721,
  "116,272": 722,
  "83,282": 723,
  "297,320": 724,
  "112,114": 725,
  "109,261": 726,
  "69,32": 727,
  "78,111": 728,
  "514,269": 729,
  "259,266": 730,
  "116,274": 731,
  "102,261": 732,
  "271,256": 733,
  "299,257": 734,
  "402,525": 735,
  "109,286": 736,
  "260,272": 737,
  "116,10": 738,
  "105,103": 739,
  "332,105": 740,
  "413,339": 741,
  "263,115": 742,
  "312,121": 743,
  "315,116": 744,
  "101,324": 745,
  "106,314": 746,
  "389,262": 747,
  "269,267": 748,
  "112,513": 749,
  "100,350": 750,
  "306,116": 751,
  "102,97": 752,
  "260,608": 753,
  "270,322": 754,
  "276,32": 755,
  "100,379": 756,
  "355,32": 757,
  "532,100": 758,
  "100,471": 759,
  "72,306": 760,
  "259,628": 761,
  "99,314": 762,
  "413,425": 763,
  "670,262": 764,
  "392,370": 765,
  "260,366": 766,
  "312,448": 767,
  "392,109": 768,
  "258,629": 769,
  "109,285": 770,
  "270,345": 771,
  "286,116": 772,
  "109,111": 773,
  "110,101": 774,
  "685,477": 775,
  "775,760": 776,
  "275,434": 777,
  "119,508": 778,
  "97,285": 779,
  "321,257": 780,
  "266,368": 781,
  "112,101": 782,
  "259,108": 783,
  "110,350": 784,
  "283,116": 785,
  "117,99": 786,
  "325,344": 787,
  "675,107": 788,
  "109,278": 789,
  "564,277": 790,
  "87,441": 791,
  "281,118": 792,
  "270,464": 793,
  "108,256": 794,
  "108,307": 795,
  "332,274": 796,
  "572,452": 797,
  "397,452": 798,
  "109,329": 799,
  "110,440": 800,
  "266,386": 801,
  "266,116": 802,
  "321,32": 803,
  "103,315": 804,
  "654,256": 805,
  "369,32": 806,
  "674,447": 807,
  "258,429": 808,
  "44,387": 809,
  "346,112": 810,
  "102,449": 811,
  "44,267": 812,
  "99,473": 813,
  "664,487": 814,
  "814,306": 815,
  "111,326": 816,
  "59,10": 817,
  "104,314": 818,
  "108,292": 819,
  "101,342": 820,
  "100,114": 821,
  "276,285": 822,
  "117,284": 823,
  "104,310": 824,
  "410,262": 825,
  "392,448": 826,
  "269,407": 827,
  "447,32": 828,
  "613,815": 829,
  "106,517": 830,
  "291,114": 831,
  "107,101": 832,
  "490,32": 833,
  "332,361": 834,
  "103,279": 835,
  "102,102": 836,
  "73,116": 837,
  "258,591": 838,
  "789,110": 839,
  "309,100": 840,
  "72,65": 841,
  "428,261": 842,
  "104,111": 843,
  "266,279": 844,
  "297,472": 845,
  "347,311": 846,
  "639,32": 847,
  "260,541": 848,
  "391,594": 849,
  "119,32": 850,
  "274,100": 851,
  "316,360": 852,
  "110,97": 853,
  "469,116": 854,
  "469,262": 855,
  "66,382": 856,
  "412,497": 857,
  "411,283": 858,
  "107,311": 859,
  "104,292": 860,
  "302,463": 861,
  "301,326": 862,
  "333,256": 863,
  "264,339": 864,
  "105,377": 865,
  "305,264": 866,
  "345,267": 867,
  "611,293": 868,
  "352,256": 869,
  "84,626": 870,
  "521,697": 871,
  "271,593": 872,
  "603,618": 873,
  "295,699": 874,
  "281,465": 875,
  "118,294": 876,
  "10,116": 877,
  "286,479": 878,
  "258,604": 879,
  "294,262": 880,
  "103,702": 881,
  "356,257": 882,
  "289,324": 883,
  "726,362": 884,
  "621,339": 885,
  "114,292": 886,
  "651,256": 887,
  "84,32": 888,
  "446,289": 889,
  "504,100": 890,
  "112,382": 891,
  "87,508": 892,
  "112,32": 893,
  "44,380": 894,
  "100,273": 895,
  "44,433": 896,
  "371,32": 897,
  "701,256": 898,
  "119,114": 899,
  "110,552": 900,
  "102,475": 901,
  "107,298": 902,
  "635,328": 903,
  "72,292": 904,
  "532,264": 905,
  "510,292": 906,
  "112,278": 907,
  "58,10": 908,
  "89,668": 909,
  "489,279": 910,
  "746,121": 911,
  "623,288": 912,
  "99,430": 913,
  "101,256": 914,
  "104,506": 915,
  "256,344": 916,
  "261,556": 917,
  "455,121": 918,
  "614,515": 919,
  "276,121": 920,
  "114,315": 921,
  "410,116": 922,
  "99,507": 923,
  "63,257": 924,
  "402,558": 925,
  "259,258": 926,
  "276,394": 927,
  "281,108": 928,
  "98,278": 929,
  "304,442": 930,
  "480,264": 931,
  "108,272": 932,
  "308,542": 933,
  "443,256": 934,
  "328,105": 935,
  "101,359": 936,
  "276,320": 937,
  "34,39": 938,
  "112,430": 939,
  "544,256": 940,
  "99,108": 941,
  "322,677": 942,
  "625,267": 943,
  "116,314": 944,
  "307,460": 945,
  "623,316": 946,
  "115,279": 947,
  "97,284": 948,
  "98,288": 949,
  "427,349": 950,
  "270,73": 951,
  "354,271": 952,
  "290,108": 953,
  "103,372": 954,
  "102,286": 955,
  "281,112": 956,
  "115,111": 957,
  "119,518": 958,
  "455,525": 959,
  "269,342": 960,
  "305,496": 961,
  "881,274": 962,
  "33,10": 963,
  "101,262": 964,
  "99,306": 965,
  "402,288": 966,
  "753,363": 967,
  "274,267": 968,
  "106,646": 969,
  "705,367": 970,
  "635,494": 971,
  "272,10": 972,
  "663,320": 973,
  "502,32": 974,
  "275,10": 975,
  "354,344": 976,
  "551,96": 977,
  "77,97": 978,
  "99,307": 979,
  "521,496": 980,
  "980,98": 981,
  "446,311": 982,
  "115,10": 983,
  "114,632": 984,
  "116,289": 985,
  "102,101": 986,
  "290,288": 987,
  "429,32": 988,
  "275,268": 989,
  "105,122": 990,
  "269,115": 991,
  "102,823": 992,
  "103,117": 993,
  "99,365": 994,
  "488,361": 995,
  "275,299": 996,
  "108,598": 997,
  "117,583": 998,
  "114,286": 999,
  "100,310": 1000,
  "288,10": 1001,
  "645,500": 1002,
  "653,361": 1003,
  "108,444": 1004,
  "576,262": 1005,
  "97,104": 1006,
  "287,10": 1007,
  "288,417": 1008,
  "357,419": 1009,
  "687,261": 1010,
  "587,32": 1011,
  "103,263": 1012,
  "424,524": 1013,
  "109,101": 1014,
  "392,334": 1015,
  "331,334": 1016,
  "576,116": 1017,
  "572,367": 1018,
  "105,118": 1019,
  "405,121": 1020,
  "411,294": 1021,
  "564,278": 1022,
  "119,414": 1023,
  "296,39": 1024,
  "353,266": 1025,
  "317,116": 1026,
  "261,343": 1027,
  "440,481": 1028,
  "1028,362": 1029,
  "352,104": 1030,
  "665,575": 1031,
  "86,657": 1032,
  "281,334": 1033,
  "781,109": 1034,
  "799,414": 1035,
  "73,10": 1036,
  "283,262": 1037,
  "804,264": 1038,
  "474,267": 1039,
  "44,260": 1040,
  "400,317": 1041,
  "101,325": 1042,
  "10,344": 1043,
  "672,267": 1044,
  "99,263": 1045,
  "732,518": 1046,
  "482,294": 1047,
  "274,378": 1048,
  "99,495": 1049,
  "592,32": 1050,
  "813,103": 1051,
  "459,264": 1052,
  "283,121": 1053,
  "412,284": 1054,
  "112,751": 1055,
  "372,328": 1056,
  "428,495": 1057,
  "483,366": 1058,
  "372,494": 1059,
  "640,32": 1060,
  "398,566": 1061,
  "398,596": 1062,
  "580,256": 1063,
  "296,270": 1064,
  "287,266": 1065,
  "98,285": 1066,
  "270,529": 1067,
  "116,346": 1068,
  "116,304": 1069,
  "286,472": 1070,
  "102,688": 1071,
  "116,347": 1072,
  "260,717": 1073,
  "335,605": 1074,
  "72,506": 1075,
  "258,278": 1076,
  "109,121": 1077,
  "68,111": 1078,
  "597,10": 1079,
  "581,274": 1080,
  "875,274": 1081,
  "59,384": 1082,
  "427,374": 1083,
  "498,269": 1084,
  "100,118": 1085,
  "284,292": 1086,
  "120,683": 1087,
  "261,406": 1088,
  "100,278": 1089,
  "412,109": 1090,
  "271,32": 1091,
  "296,10": 1092,
  "84,491": 1093,
  "295,266": 1094,
  "261,264": 1095,
  "340,267": 1096,
  "638,658": 1097,
  "355,384": 1098,
  "281,284": 1099,
  "46,41": 1100,
  "295,10": 1101,
  "115,424": 1102,
  "899,288": 1103,
  "353,267": 1104,
  "416,369": 1105,
  "925,460": 1106,
  "740,477": 1107,
  "606,112": 1108,
  "33,32": 1109,
  "302,403": 1110,
  "435,388": 1111,
  "287,406": 1112,
  "104,469": 1113,
  "270,543": 1114,
  "353,302": 1115,
  "362,601": 1116,
  "116,311": 1117,
  "388,116": 1118,
  "101,417": 1119,
  "480,100": 1120,
  "704,100": 1121,
  "388,102": 1122,
  "737,115": 1123,
  "102,306": 1124,
  "281,935": 1125,
  "431,836": 1126,
  "103,416": 1127,
  "101,327": 1128,
  "58,327": 1129,
  "288,478": 1130,
  "663,461": 1131,
  "274,479": 1132,
  "446,272": 1133,
  "714,111": 1134,
  "110,368": 1135,
  "657,32": 1136,
  "470,269": 1137,
  "287,302": 1138,
  "73,83": 1139,
  "336,288": 1140,
  "112,116": 1141,
  "97,103": 1142,
  "105,334": 1143,
  "379,278": 1144,
  "351,337": 1145,
  "380,107": 1146,
  "68,261": 1147,
  "39,334": 1148,
  "981,263": 1149,
  "114,307": 1150,
  "326,400": 1151,
  "108,311": 1152,
  "561,101": 1153,
  "98,388": 1154,
  "1045,1010": 1155,
  "862,585": 1156,
  "267,115": 1157,
  "648,648": 1158,
  "341,864": 1159,
  "317,10": 1160,
  "393,32": 1161,
  "553,256": 1162,
  "481,116": 1163,
  "321,470": 1164,
  "333,99": 1165,
  "97,32": 1166,
  "473,100": 1167,
  "104,475": 1168,
  "110,298": 1169,
  "112,117": 1170,
  "107,774": 1171,
  "415,474": 1172,
  "291,108": 1173,
  "606,98": 1174,
  "77,715": 1175,
  "97,115": 1176,
  "119,256": 1177,
  "446,298": 1178,
  "304,111": 1179,
  "112,105": 1180,
  "106,111": 1181,
  "478,267": 1182,
  "66,487": 1183,
  "121,509": 1184,
  "327,10": 1185,
  "112,739": 1186,
  "259,583": 1187,
  "263,273": 1188,
  "98,328": 1189,
  "73,78": 1190,
  "975,257": 1191,
  "281,394": 1192,
  "343,32": 1193,
  "313,115": 1194,
  "115,379": 1195,
  "99,614": 1196,
  "749,115": 1197,
  "1032,89": 1198,
  "270,316": 1199,
  "387,344": 1200,
  "99,107": 1201,
  "289,389": 1202,
  "800,116": 1203,
  "476,383": 1204,
  "115,384": 1205,
  "720,32": 1206,
  "890,121": 1207,
  "801,302": 1208,
  "105,477": 1209,
  "350,110": 1210,
  "921,109": 1211,
  "117,100": 1212,
  "274,619": 1213,
  "395,322": 1214,
  "259,109": 1215,
  "548,956": 1216,
  "1147,1006": 1217,
  "291,100": 1218,
  "109,855": 1219,
  "115,438": 1220,
  "332,310": 1221,
  "44,258": 1222,
  "266,97": 1223,
  "637,65": 1224,
  "317,412": 1225,
  "68,32": 1226,
  "117,318": 1227,
  "418,104": 1228,
  "308,98": 1229,
  "631,109": 1230,
  "271,337": 1231,
  "261,10": 1232,
  "110,272": 1233,
  "1170,122": 1234,
  "1234,122": 1235,
  "1021,515": 1236,
  "298,288": 1237,
  "79,110": 1238,
  "355,424": 1239,
  "627,264": 1240,
  "336,642": 1241,
  "363,324": 1242,
  "544,109": 1243,
  "72,256": 1244,
  "465,350": 1245,
  "790,289": 1246,
  "265,112": 1247,
  "98,435": 1248,
  "359,419": 1249,
  "371,280": 1250,
  "998,274": 1251,
  "303,349": 1252,
  "65,32": 1253,
  "73,110": 1254,
  "443,399": 1255,
  "266,507": 1256,
  "330,279": 1257,
  "305,256": 1258,
  "103,32": 1259,
  "630,288": 1260,
  "265,100": 1261,
  "256,421": 1262,
  "277,328": 1263,
  "782,581": 1264,
  "114,378": 1265,
  "958,32": 1266,
  "278,262": 1267,
  "355,269": 1268,
  "99,570": 1269,
  "317,104": 1270,
  "103,103": 1271,
  "108,100": 1272,
  "391,284": 1273,
  "904,405": 1274,
  "709,270": 1275,
  "414,314": 1276,
  "87,491": 1277,
  "522,461": 1278,
  "1153,289": 1279,
  "376,32": 1280,
  "443,351": 1281,
  "102,111": 1282,
  "114,272": 1283,
  "762,683": 1284,
  "276,1087": 1285,
  "332,279": 1286,
  "301,967": 1287,
  "119,772": 1288,
  "402,101": 1289,
  "800,262": 1290,
  "112,362": 1291,
  "557,458": 1292,
  "324,322": 1293,
  "117,98": 1294,
  "291,264": 1295,
  "994,944": 1296,
  "332,480": 1297,
  "288,115": 1298,
  "274,99": 1299,
  "323,285": 1300,
  "266,379": 1301,
  "989,96": 1302,
  "416,119": 1303,
  "357,734": 1304,
  "566,32": 1305,
  "642,116": 1306,
  "568,377": 1307,
  "299,268": 1308,
  "67,841": 1309,
  "1309,80": 1310,
  "1310,84": 1311,
  "1311,1136": 1312,
  "408,385": 1313,
  "97,273": 1314,
  "889,498": 1315,
  "102,372": 1316,
  "340,116": 1317,
  "669,266": 1318,
  "100,598": 1319,
  "797,32": 1320,
  "355,377": 1321,
  "456,421": 1322,
  "108,1210": 1323,
  "315,108": 1324,
  "287,373": 1325,
  "1263,274": 1326,
  "266,471": 1327,
  "319,723": 1328,
  "405,32": 1329,
  "383,107": 1330,
  "261,660": 1331,
  "818,420": 1332,
  "325,360": 1333,
  "110,263": 1334,
  "399,334": 1335,
  "101,45": 1336,
  "118,101": 1337,
  "273,336": 1338,
  "276,472": 1339,
  "102,561": 1340,
  "740,304": 1341,
  "44,503": 1342,
  "59,711": 1343,
  "549,914": 1344,
  "389,369": 1345,
  "101,274": 1346,
  "404,370": 1347,
  "1282,1086": 1348,
  "391,107": 1349,
  "305,116": 1350,
  "266,314": 1351,
  "514,377": 1352,
  "725,294": 1353,
  "431,1165": 1354,
  "103,570": 1355,
  "901,262": 1356,
  "65,115": 1357,
  "357,96": 1358,
  "907,107": 1359,
  "808,107": 1360,
  "77,575": 1361,
  "274,624": 1362,
  "595,101": 1363,
  "703,107": 1364,
  "928,102": 1365,
  "327,419": 1366,
  "102,502": 1367,
  "511,552": 1368,
  "98,364": 1369,
  "319,339": 1370,
  "489,111": 1371,
  "810,785": 1372,
  "938,293": 1373,
  "342,324": 1374,
  "790,311": 1375,
  "66,362": 1376,
  "327,34": 1377,
  "258,390": 1378,
  "115,507": 1379,
  "10,434": 1380,
  "89,294": 1381,
  "383,502": 1382,
  "102,744": 1383,
  "959,912": 1384,
  "72,263": 1385,
  "98,352": 1386,
  "256,283": 1387,
  "272,267": 1388,
  "274,264": 1389,
  "664,414": 1390,
  "398,684": 1391,
  "577,324": 1392,
  "665,715": 1393,
  "1027,114": 1394,
  "1394,355": 1395,
  "978,106": 1396,
  "1396,558": 1397,
  "75,298": 1398,
  "580,101": 1399,
  "974,83": 1400,
  "76,76": 1401,
  "316,400": 1402,
  "112,383": 1403,
  "408,288": 1404,
  "345,396": 1405,
  "83,816": 1406,
  "482,462": 1407,
  "335,615": 1408,
  "796,326": 1409,
  "666,116": 1410,
  "290,1069": 1411,
  "104,1202": 1412,
  "108,264": 1413,
  "111,465": 1414,
  "119,604": 1415,
  "342,270": 1416,
  "112,108": 1417,
  "274,326": 1418,
  "65,82": 1419,
  "499,279": 1420,
  "287,258": 1421,
  "119,919": 1422,
  "599,562": 1423,
  "538,602": 1424,
  "305,270": 1425,
  "97,109": 1426,
  "68,279": 1427,
  "270,531": 1428,
  "44,644": 1429,
  "308,486": 1430,
  "114,422": 1431,
  "427,338": 1432,
  "70,283": 1433,
  "365,284": 1434,
  "77,69": 1435,
  "929,1116": 1436,
  "289,330": 1437,
  "353,10": 1438,
  "102,314": 1439,
  "258,420": 1440,
  "351,272": 1441,
  "259,1085": 1442,
  "274,263": 1443,
  "504,120": 1444,
  "115,269": 1445,
  "445,112": 1446,
  "105,264": 1447,
  "350,115": 1448,
  "512,713": 1449,
  "114,688": 1450,
  "112,262": 1451,
  "73,373": 1452,
  "110,444": 1453,
  "392,284": 1454,
  "105,370": 1455,
  "10,419": 1456,
  "286,394": 1457,
  "299,451": 1458,
  "289,549": 1459,
  "332,442": 1460,
  "930,100": 1461,
  "294,256": 1462,
  "115,671": 1463,
  "271,608": 1464,
  "108,289": 1465,
  "121,270": 1466,
  "1372,772": 1467,
  "423,322": 1468,
  "99,114": 1469,
  "116,261": 1470,
  "1037,336": 1471,
  "114,397": 1472,
  "483,310": 1473,
  "1093,417": 1474,
  "512,361": 1475,
  "258,487": 1476,
  "375,346": 1477,
  "450,464": 1478,
  "261,328": 1479,
  "884,1387": 1480,
  "100,265": 1481,
  "286,320": 1482,
  "107,598": 1483,
  "109,265": 1484,
  "321,267": 1485,
  "79,102": 1486,
  "80,105": 1487,
  "1487,389": 1488,
  "70,744": 1489,
  "1135,122": 1490,
  "678,32": 1491,
  "776,256": 1492,
  "480,431": 1493,
  "706,1397": 1494,
  "1029,460": 1495,
  "100,878": 1496,
  "83,32": 1497,
  "73,84": 1498,
  "335,10": 1499,
  "256,336": 1500,
  "523,486": 1501,
  "274,266": 1502,
  "435,794": 1503,
  "710,1033": 1504,
  "270,283": 1505,
  "115,288": 1506,
  "761,32": 1507,
  "276,490": 1508,
  "399,115": 1509,
  "319,83": 1510,
  "324,892": 1511,
  "109,105": 1512,
  "288,285": 1513,
  "1000,116": 1514,
  "371,257": 1515,
  "1215,484": 1516,
  "40,344": 1517,
  "756,515": 1518,
  "955,99": 1519,
  "286,262": 1520,
  "808,659": 1521,
  "457,285": 1522,
  "101,432": 1523,
  "100,365": 1524,
  "901,116": 1525,
  "106,1108": 1526,
  "620,32": 1527,
  "119,561": 1528,
  "405,285": 1529,
  "100,101": 1530,
  "574,500": 1531,
  "928,373": 1532,
  "504,381": 1533,
  "538,895": 1534,
  "930,821": 1535,
  "45,116": 1536,
  "529,343": 1537,
  "265,273": 1538,
  "576,731": 1539,
  "340,302": 1540,
  "410,298": 1541,
  "319,322": 1542,
  "100,481": 1543,
  "1084,479": 1544,
  "103,1443": 1545,
  "1121,407": 1546,
  "725,310": 1547,
  "536,464": 1548,
  "103,277": 1549,
  "315,100": 1550,
  "98,693": 1551,
  "317,361": 1552,
  "455,279": 1553,
  "259,448": 1554,
  "1171,119": 1555,
  "111,104": 1556,
  "510,261": 1557,
  "67,507": 1558,
  "473,602": 1559,
  "259,539": 1560,
  "84,441": 1561,
  "675,358": 1562,
  "1156,933": 1563,
  "277,986": 1564,
  "317,298": 1565,
  "443,101": 1566,
  "109,272": 1567,
  "319,425": 1568,
  "505,851": 1569,
  "278,1012": 1570,
  "287,589": 1571,
  "1054,311": 1572,
  "275,777": 1573,
  "102,352": 1574,
  "512,482": 1575,
  "512,366": 1576,
  "44,769": 1577,
  "317,277": 1578,
  "109,501": 1579,
  "1180,481": 1580,
  "79,373": 1581,
  "1581,642": 1582,
  "97,583": 1583,
  "703,594": 1584,
  "118,349": 1585,
  "104,101": 1586,
  "118,311": 1587,
  "328,315": 1588,
  "108,716": 1589,
  "108,294": 1590,
  "398,829": 1591,
  "108,298": 1592,
  "332,288": 1593,
  "402,509": 1594,
  "99,390": 1595,
  "499,816": 1596,
  "795,294": 1597,
  "1486,373": 1598,
  "1494,121": 1599,
  "398,650": 1600,
  "516,650": 1601,
  "1064,1018": 1602,
  "357,268": 1603,
  "119,288": 1604,
  "65,78": 1605,
  "637,727": 1606,
  "98,390": 1607,
  "597,266": 1608,
  "1251,342": 1609,
  "1198,32": 1610,
  "396,421": 1611,
  "290,114": 1612,
  "110,307": 1613,
  "416,98": 1614,
  "101,105": 1615,
  "308,747": 1616,
  "752,284": 1617,
  "302,466": 1618,
  "261,116": 1619,
  "680,298": 1620,
  "104,575": 1621,
  "700,486": 1622,
  "638,722": 1623,
  "266,671": 1624,
  "102,454": 1625,
  "296,781": 1626,
  "805,360": 1627,
  "32,96": 1628,
  "383,256": 1629,
  "416,806": 1630,
  "263,256": 1631,
  "1102,832": 1632,
  "296,898": 1633,
  "728,270": 1634,
  "1216,273": 1635,
  "104,581": 1636,
  "384,115": 1637,
  "443,519": 1638,
  "492,107": 1639,
  "1041,274": 1640,
  "379,100": 1641,
  "954,681": 1642,
  "410,1272": 1643,
  "450,529": 1644,
  "261,304": 1645,
  "1434,285": 1646,
  "44,41": 1647,
  "332,101": 1648,
  "351,713": 1649,
  "668,76": 1650,
  "101,364": 1651,
  "316,310": 1652,
  "773,494": 1653,
  "78,79": 1654,
  "388,270": 1655,
  "762,105": 1656,
  "457,261": 1657,
  "73,1083": 1658,
  "311,408": 1659,
  "385,758": 1660,
  "418,314": 1661,
  "734,32": 1662,
  "799,437": 1663,
  "603,103": 1664,
  "44,743": 1665,
  "67,104": 1666,
  "115,308": 1667,
  "786,107": 1668,
  "560,456": 1669,
  "333,116": 1670,
  "832,1451": 1671,
  "707,121": 1672,
  "1355,876": 1673,
  "259,682": 1674,
  "908,96": 1675,
  "1126,263": 1676,
  "317,274": 1677,
  "102,518": 1678,
  "97,119": 1679,
  "476,270": 1680,
  "890,285": 1681,
  "732,264": 1682,
  "115,278": 1683,
  "119,101": 1684,
  "98,430": 1685,
  "116,1053": 1686,
  "112,306": 1687,
  "286,103": 1688,
  "87,256": 1689,
  "342,10": 1690,
  "68,269": 1691,
  "342,537": 1692,
  "117,305": 1693,
  "1297,256": 1694,
  "63,10": 1695,
  "1470,117": 1696,
  "289,838": 1697,
  "440,636": 1698,
  "409,302": 1699,
  "1122,262": 1700,
  "114,880": 1701,
  "442,1132": 1702,
  "112,347": 1703,
  "1241,305": 1704,
  "1221,548": 1705,
  "783,539": 1706,
  "307,105": 1707,
  "115,270": 1708,
  "283,452": 1709,
  "625,302": 1710,
  "266,329": 1711,
  "278,45": 1712,
  "504,271": 1713,
  "105,101": 1714,
  "391,285": 1715,
  "118,298": 1716,
  "84,691": 1717,
  "837,478": 1718,
  "309,264": 1719,
  "647,425": 1720,
  "398,613": 1721,
  "84,119": 1722,
  "665,439": 1723,
  "75,853": 1724,
  "516,565": 1725,
  "1412,843": 1726,
  "570,1189": 1727,
  "66,278": 1728,
  "69,78": 1729,
  "79,78": 1730,
  "73,777": 1731,
  "288,658": 1732,
  "310,343": 1733,
  "269,624": 1734,
  "1194,945": 1735,
  "310,267": 1736,
  "644,1196": 1737,
  "100,779": 1738,
  "32,750": 1739,
  "818,846": 1740,
  "109,561": 1741,
  "305,274": 1742,
  "99,111": 1743,
  "102,105": 1744,
  "288,270": 1745,
  "499,111": 1746,
  "410,569": 1747,
  "652,681": 1748,
  "308,385": 1749,
  "457,286": 1750,
  "784,267": 1751,
  "305,313": 1752,
  "1414,785": 1753,
  "1753,397": 1754,
  "1754,1513": 1755,
  "271,307": 1756,
  "1144,32": 1757,
  "114,294": 1758,
  "483,278": 1759,
  "319,870": 1760,
  "269,10": 1761,
  "109,310": 1762,
  "768,259": 1763,
  "302,98": 1764,
  "276,1220": 1765,
  "534,349": 1766,
  "78,292": 1767,
  "666,262": 1768,
  "100,306": 1769,
  "276,833": 1770,
  "1270,1095": 1771,
  "489,1209": 1772,
  "103,298": 1773,
  "953,859": 1774,
  "387,316": 1775,
  "822,1150": 1776,
  "562,256": 1777,
  "277,318": 1778,
  "102,632": 1779,
  "315,708": 1780,
  "260,1265": 1781,
  "1013,363": 1782,
  "698,101": 1783,
  "317,108": 1784,
  "694,353": 1785,
  "1224,888": 1786,
  "34,32": 1787,
  "365,264": 1788,
  "543,348": 1789,
  "345,302": 1790,
  "352,117": 1791,
  "411,524": 1792,
  "1657,362": 1793,
  "586,344": 1794,
  "344,400": 1795,
  "105,98": 1796,
  "266,337": 1797,
  "582,10": 1798,
  "636,121": 1799,
  "342,298": 1800,
  "322,1049": 1801,
  "333,101": 1802,
  "906,272": 1803,
  "101,354": 1804,
  "1662,1312": 1805,
  "1354,116": 1806,
  "269,349": 1807,
  "44,308": 1808,
  "260,495": 1809,
  "109,311": 1810,
  "520,467": 1811,
  "670,738": 1812,
  "959,946": 1813,
  "595,936": 1814,
  "894,267": 1815,
  "281,364": 1816,
  "115,325": 1817,
  "352,571": 1818,
  "112,288": 1819,
  "1004,991": 1820,
  "258,1173": 1821,
  "359,322": 1822,
  "102,1539": 1823,
  "503,10": 1824,
  "119,1550": 1825,
  "1289,263": 1826,
  "692,348": 1827,
  "260,298": 1828,
  "920,605": 1829,
  "1164,347": 1830,
  "98,114": 1831,
  "841,84": 1832,
  "332,285": 1833,
  "99,886": 1834,
  "1078,411": 1835,
  "107,121": 1836,
  "1026,343": 1837,
  "582,269": 1838,
  "270,690": 1839,
  "278,115": 1840,
  "1041,361": 1841,
  "98,292": 1842,
  "1155,342": 1843,
  "258,347": 1844,
  "98,365": 1845,
  "276,103": 1846,
  "274,305": 1847,
  "749,547": 1848,
  "909,82": 1849,
  "342,395": 1850,
  "328,263": 1851,
  "261,926": 1852,
  "325,339": 1853,
  "399,273": 1854,
  "710,1239": 1855,
  "921,448": 1856,
  "1528,292": 1857,
  "301,10": 1858,
  "595,256": 1859,
  "116,496": 1860,
  "347,101": 1861,
  "286,619": 1862,
  "1480,1134": 1863,
  "1481,98": 1864,
  "1864,116": 1865,
  "260,1462": 1866,
  "415,406": 1867,
  "1484,271": 1868,
  "286,99": 1869,
  "109,1030": 1870,
  "792,274": 1871,
  "557,32": 1872,
  "992,121": 1873,
  "582,98": 1874,
  "100,707": 1875,
  "294,273": 1876,
  "294,104": 1877,
  "364,256": 1878,
  "653,274": 1879,
  "1400,1247": 1880,
  "266,1597": 1881,
  "364,311": 1882,
  "609,1195": 1883,
  "1883,263": 1884,
  "666,708": 1885,
  "355,379": 1886,
  "115,471": 1887,
  "792,349": 1888,
  "259,99": 1889,
  "87,65": 1890,
  "270,339": 1891,
  "289,686": 1892,
  "1201,509": 1893,
  "913,681": 1894,
  "101,407": 1895,
  "10,436": 1896,
  "302,873": 1897,
  "114,291": 1898,
  "70,364": 1899,
  "443,600": 1900,
  "100,430": 1901,
  "736,1142": 1902,
  "39,284": 1903,
  "920,615": 1904,
  "119,626": 1905,
  "611,32": 1906,
  "673,267": 1907,
  "1514,878": 1908,
  "260,593": 1909,
  "114,285": 1910,
  "103,364": 1911,
  "116,361": 1912,
  "96,322": 1913,
  "109,442": 1914,
  "438,349": 1915,
  "306,256": 1916,
  "1763,573": 1917,
  "979,273": 1918,
  "428,397": 1919,
  "473,264": 1920,
  "114,117": 1921,
  "652,115": 1922,
  "102,422": 1923,
  "1431,320": 1924,
  "109,1641": 1925,
  "107,482": 1926,
  "1530,1778": 1927,
  "603,1012": 1928,
  "111,547": 1929,
  "563,419": 1930,
  "1432,452": 1931,
  "736,285": 1932,
  "986,119": 1933,
  "424,681": 1934,
  "961,571": 1935,
  "788,588": 1936,
  "1264,794": 1937,
  "110,481": 1938,
  "310,256": 1939,
  "109,697": 1940,
  "1114,348": 1941,
  "118,1276": 1942,
  "385,811": 1943,
  "410,272": 1944,
  "860,405": 1945,
  "601,326": 1946,
  "445,1345": 1947,
  "1543,379": 1948,
  "465,263": 1949,
  "1119,655": 1950,
  "522,864": 1951,
  "1545,948": 1952,
  "435,108": 1953,
  "510,506": 1954,
  "325,585": 1955,
  "105,304": 1956,
  "121,10": 1957,
  "1164,846": 1958,
  "69,110": 1959,
  "1034,571": 1960,
  "396,1065": 1961,
  "1124,32": 1962,
  "1287,359": 1963,
  "112,831": 1964,
  "1417,286": 1965,
  "69,83": 1966,
  "72,69": 1967,
  "357,434": 1968,
  "87,73": 1969,
  "74,646": 1970,
  "385,905": 1971,
  "261,256": 1972,
  "397,116": 1973,
  "112,1324": 1974,
  "98,418": 1975,
  "100,294": 1976,
  "118,105": 1977,
  "1977,480": 1978,
  "969,433": 1979,
  "311,261": 1980,
  "834,322": 1981,
  "322,970": 1982,
  "357,676": 1983,
  "307,865": 1984,
  "700,527": 1985,
  "262,288": 1986,
  "992,285": 1987,
  "115,357": 1988,
  "636,285": 1989,
  "260,274": 1990,
  "317,272": 1991,
  "115,314": 1992,
  "379,342": 1993,
  "957,377": 1994,
  "302,1038": 1995,
  "1089,708": 1996,
  "114,495": 1997,
  "97,100": 1998,
  "1040,274": 1999,
  "87,374": 2000,
  "798,328": 2001,
  "634,32": 2002,
  "442,277": 2003,
  "1687,511": 2004,
  "652,119": 2005,
  "101,478": 2006,
  "1294,106": 2007,
  "1691,367": 2008,
  "853,109": 2009,
  "399,458": 2010,
  "349,115": 2011,
  "645,476": 2012,
  "433,316": 2013,
  "460,270": 2014,
  "1573,1805": 2015,
  "397,719": 2016,
  "115,377": 2017,
  "277,116": 2018,
  "87,1832": 2019,
  "1250,425": 2020,
  "351,366": 2021,
  "770,750": 2022,
  "388,109": 2023,
  "2023,110": 2024,
  "307,267": 2025,
  "109,289": 2026,
  "839,298": 2027,
  "485,320": 2028,
  "267,98": 2029,
  "462,336": 2030,
  "489,442": 2031,
  "59,937": 2032,
  "102,117": 2033,
  "308,411": 2034,
  "1378,267": 2035,
  "105,305": 2036,
  "563,464": 2037,
  "100,274": 2038,
  "299,32": 2039,
  "421,115": 2040,
  "695,425": 2041,
  "39,264": 2042,
  "459,320": 2043,
  "512,310": 2044,
  "67,329": 2045,
  "837,417": 2046,
  "440,116": 2047,
  "321,326": 2048,
  "1020,615": 2049,
  "260,863": 2050,
  "1588,264": 2051,
  "1685,107": 2052,
  "304,346": 2053,
  "2053,110": 2054,
  "103,333": 2055,
  "483,350": 2056,
  "1100,293": 2057,
  "311,316": 2058,
  "115,990": 2059,
  "1386,261": 2060,
  "102,108": 2061,
  "108,1261": 2062,
  "102,974": 2063,
  "408,345": 2064,
  "1126,1382": 2065,
  "116,333": 2066,
  "112,355": 2067,
  "2067,112": 2068,
  "392,264": 2069,
  "784,407": 2070,
  "109,854": 2071,
  "265,416": 2072,
  "115,327": 2073,
  "325,661": 2074,
  "99,444": 2075,
  "335,305": 2076,
  "99,388": 2077,
  "1225,869": 2078,
  "345,1058": 2079,
  "913,1594": 2080,
  "1489,736": 2081,
  "1666,1877": 2082,
  "2082,1878": 2083,
  "647,339": 2084,
  "67,337": 2085,
  "776,101": 2086,
  "259,1245": 2087,
  "380,997": 2088,
  "98,707": 2089,
  "2089,45": 2090,
  "541,388": 2091,
  "828,690": 2092,
  "427,409": 2093,
  "653,379": 2094,
  "1316,1567": 2095,
  "1727,742": 2096,
  "621,282": 2097,
  "299,1728": 2098,
  "315,327": 2099,
  "2099,315": 2100,
  "596,840": 2101,
  "1604,1453": 2102,
  "32,1606": 2103,
  "77,32": 2104,
  "110,569": 2105,
  "1403,944": 2106,
  "121,45": 2107,
  "114,265": 2108,
  "10,316": 2109,
  "1613,314": 2110,
  "845,361": 2111,
  "270,610": 2112,
  "115,273": 2113,
  "1615,369": 2114,
  "424,1893": 2115,
  "470,314": 2116,
  "288,325": 2117,
  "339,97": 2118,
  "269,99": 2119,
  "344,360": 2120,
  "286,121": 2121,
  "104,397": 2122,
  "104,349": 2123,
  "712,10": 2124,
  "311,96": 2125,
  "79,82": 2126,
  "351,482": 2127,
  "543,322": 2128,
  "893,421": 2129,
  "455,1209": 2130,
  "308,295": 2131,
  "260,361": 2132,
  "102,397": 2133,
  "116,105": 2134,
  "853,497": 2135,
  "97,618": 2136,
  "739,110": 2137,
  "266,914": 2138,
  "607,336": 2139,
  "457,575": 2140,
  "98,307": 2141,
  "645,348": 2142,
  "513,876": 2143,
  "302,99": 2144,
  "116,629": 2145,
  "720,267": 2146,
  "326,360": 2147,
  "440,479": 2148,
  "1643,361": 2149,
  "266,1273": 2150,
  "415,1776": 2151,
  "287,426": 2152,
  "319,1274": 2153,
  "1645,462": 2154,
  "260,286": 2155,
  "426,272": 2156,
  "1533,256": 2157,
  "360,500": 2158,
  "548,32": 2159,
  "104,931": 2160,
  "340,922": 2161,
  "2161,731": 2162,
  "811,116": 2163,
  "582,377": 2164,
  "1158,648": 2165,
  "2165,540": 2166,
  "1277,302": 2167,
  "267,463": 2168,
  "270,340": 2169,
  "413,65": 2170,
  "103,273": 2171,
  "44,654": 2172,
  "1281,307": 2173,
  "321,10": 2174,
  "420,569": 2175,
  "264,336": 2176,
  "731,100": 2177,
  "375,119": 2178,
  "112,1163": 2179,
  "83,111": 2180,
  "543,316": 2181,
  "1349,462": 2182,
  "695,723": 2183,
  "693,463": 2184,
  "1285,342": 2185,
  "933,359": 2186,
  "308,538": 2187,
  "1959,1549": 2188,
  "2188,534": 2189,
  "1961,854": 2190,
  "44,535": 2191,
  "953,107": 2192,
  "76,964": 2193,
  "103,1019": 2194,
  "432,586": 2195,
  "1806,460": 2196,
  "110,991": 2197,
  "115,337": 2198,
  "577,359": 2199,
  "1125,407": 2200,
  "332,525": 2201,
  "430,116": 2202,
  "764,1332": 2203,
  "362,343": 2204,
  "433,282": 2205,
  "32,295": 2206,
  "1901,465": 2207,
  "599,10": 2208,
  "1554,73": 2209,
  "65,104": 2210,
  "541,298": 2211,
  "325,534": 2212,
  "438,418": 2213,
  "277,370": 2214,
  "455,111": 2215,
  "459,472": 2216,
  "954,100": 2217,
  "261,266": 2218,
  "1266,322": 2219,
  "656,515": 2220,
  "79,32": 2221,
  "70,114": 2222,
  "87,2003": 2223,
  "528,385": 2224,
  "350,32": 2225,
  "424,283": 2226,
  "261,259": 2227,
  "347,284": 2228,
  "121,964": 2229,
  "1519,121": 2230,
  "105,342": 2231,
  "110,314": 2232,
  "1024,264": 2233,
  "119,614": 2234,
  "633,322": 2235,
  "609,1735": 2236,
  "270,560": 2237,
  "102,509": 2238,
  "283,886": 2239,
  "966,399": 2240,
  "769,311": 2241,
  "879,348": 2242,
  "1834,100": 2243,
  "711,302": 2244,
  "1269,115": 2245,
  "656,302": 2246,
  "544,103": 2247,
  "498,1056": 2248,
  "424,2018": 2249,
  "2249,820": 2250,
  "483,346": 2251,
  "100,786": 2252,
  "1696,289": 2253,
  "109,475": 2254,
  "2254,286": 2255,
  "2255,1179": 2256,
  "692,288": 2257,
  "331,284": 2258,
  "440,449": 2259,
  "1339,274": 2260,
  "116,119": 2261,
  "1472,1169": 2262,
  "489,274": 2263,
  "454,32": 2264,
  "319,65": 2265,
  "395,791": 2266,
  "897,282": 2267,
  "1577,272": 2268,
  "324,694": 2269,
  "1845,271": 2270,
  "1846,347": 2271,
  "1706,273": 2272,
  "1168,112": 2273,
  "803,339": 2274,
  "490,115": 2275,
  "810,1707": 2276,
  "496,548": 2277,
  "104,715": 2278,
  "656,308": 2279,
  "2054,482": 2280,
  "105,407": 2281,
  "935,334": 2282,
  "266,1471": 2283,
  "286,1220": 2284,
  "365,1445": 2285,
  "423,892": 2286,
  "2060,444": 2287,
  "321,967": 2288,
  "1711,1477": 2289,
  "409,267": 2290,
  "372,100": 2291,
  "83,279": 2292,
  "987,289": 2293,
  "99,919": 2294,
  "294,10": 2295,
  "102,508": 2296,
  "1026,1193": 2297,
  "97,334": 2298,
  "287,767": 2299,
  "1927,116": 2300,
  "76,990": 2301,
  "993,261": 2302,
  "2302,1712": 2303,
  "2303,1186": 2304,
  "490,1301": 2305,
  "634,267": 2306,
  "102,1120": 2307,
  "595,745": 2308,
  "513,494": 2309,
  "577,563": 2310,
  "339,574": 2311,
  "380,267": 2312,
  "395,765": 2313,
  "324,728": 2314,
  "85,83": 2315,
  "357,451": 2316,
  "817,268": 2317,
  "296,271": 2318,
  "824,266": 2319,
  "103,1455": 2320,
  "577,537": 2321,
  "1852,456": 2322,
  "109,274": 2323,
  "324,83": 2324,
  "1488,269": 2325,
  "431,103": 2326,
  "1717,417": 2327,
  "101,1271": 2328,
  "351,863": 2329,
  "368,107": 2330,
  "261,118": 2331,
  "308,363": 2332,
  "442,414": 2333,
  "100,456": 2334,
  "109,495": 2335,
  "100,518": 2336,
  "1131,324": 2337,
  "1248,121": 2338,
  "426,713": 2339,
  "1248,285": 2340,
  "354,419": 2341,
  "729,359": 2342,
  "546,348": 2343,
  "837,1182": 2344,
  "776,745": 2345,
  "1230,1441": 2346,
  "546,322": 2347,
  "301,1187": 2348,
  "371,267": 2349,
  "418,1218": 2350,
  "336,72": 2351,
  "2351,350": 2352,
  "2352,116": 2353,
  "440,941": 2354,
  "2354,291": 2355,
  "676,45": 2356,
  "100,1303": 2357,
  "1040,378": 2358,
  "70,1019": 2359,
  "1493,1188": 2360,
  "1724,370": 2361,
  "939,2075": 2362,
  "696,565": 2363,
  "112,449": 2364,
  "1558,269": 2365,
  "2095,111": 2366,
  "398,580": 2367,
  "555,1307": 2368,
  "111,1189": 2369,
  "1593,272": 2370,
  "1181,1088": 2371,
  "1602,1064": 2372,
  "2372,1016": 2373,
  "1436,1880": 2374,
  "640,1881": 2375,
  "842,2105": 2376,
  "258,1882": 2377,
  "1094,1733": 2378,
  "98,286": 2379,
  "792,298": 2380,
  "328,1886": 2381,
  "288,467": 2382,
  "289,259": 2383,
  "698,256": 2384,
  "310,116": 2385,
  "111,1506": 2386,
  "2386,121": 2387,
  "1614,949": 2388,
  "538,1413": 2389,
  "344,353": 2390,
  "409,530": 2391,
  "339,400": 2392,
  "330,848": 2393,
  "698,916": 2394,
  "102,604": 2395,
  "1320,546": 2396,
  "1899,328": 2397,
  "849,396": 2398,
  "719,272": 2399,
  "1204,289": 2400,
  "103,115": 2401,
  "556,542": 2402,
  "115,432": 2403,
  "483,292": 2404,
  "1512,388": 2405,
  "672,1423": 2406,
  "371,326": 2407,
  "76,509": 2408,
  "1004,269": 2409,
  "304,1324": 2410,
  "765,922": 2411,
  "493,471": 2412,
  "538,100": 2413,
  "99,422": 2414,
  "80,513": 2415,
  "662,556": 2416,
  "1911,108": 2417,
  "119,691": 2418,
  "466,587": 2419,
  "110,854": 2420,
  "750,432": 2421,
  "1266,348": 2422,
  "308,638": 2423,
  "569,542": 2424,
  "509,346": 2425,
  "270,1626": 2426,
  "1524,109": 2427,
  "278,116": 2428,
  "857,1268": 2429,
  "328,1330": 2430,
  "821,285": 2431,
  "562,600": 2432,
  "32,288": 2433,
  "99,283": 2434,
  "114,506": 2435,
  "438,1335": 2436,
  "817,419": 2437,
  "418,379": 2438,
  "420,298": 2439,
  "631,100": 2440,
  "436,267": 2441,
  "797,298": 2442,
  "44,528": 2443,
  "493,111": 2444,
  "2149,1926": 2445,
  "363,417": 2446,
  "44,259": 2447,
  "258,315": 2448,
  "523,500": 2449,
  "107,110": 2450,
  "396,287": 2451,
  "119,286": 2452,
  "2452,452": 2453,
  "267,858": 2454,
  "301,753": 2455,
  "10,322": 2456,
  "73,1073": 2457,
  "960,10": 2458,
  "271,1336": 2459,
  "987,298": 2460,
  "116,1111": 2461,
  "1190,75": 2462,
  "1648,806": 2463,
  "1225,352": 2464,
  "87,1650": 2465,
  "102,347": 2466,
  "99,382": 2467,
  "102,272": 2468,
  "1654,84": 2469,
  "270,408": 2470,
  "597,2164": 2471,
  "989,2166": 2472,
  "1656,1538": 2473,
  "666,932": 2474,
  "355,10": 2475,
  "1933,1793": 2476,
  "427,114": 2477,
  "1334,118": 2478,
  "266,1346": 2479,
  "610,288": 2480,
  "67,671": 2481,
  "266,704": 2482,
  "804,100": 2483,
  "329,32": 2484,
  "1348,311": 2485,
  "350,273": 2486,
  "1122,116": 2487,
  "548,1445": 2488,
  "412,107": 2489,
  "1446,721": 2490,
  "333,391": 2491,
  "1350,2187": 2492,
  "73,1731": 2493,
  "1191,96": 2494,
  "735,340": 2495,
  "907,358": 2496,
  "298,396": 2497,
  "307,10": 2498,
  "1351,256": 2499,
  "1089,108": 2500,
  "680,256": 2501,
  "1077,467": 2502,
  "98,880": 2503,
  "1216,115": 2504,
  "308,410": 2505,
  "1353,414": 2506,
  "996,268": 2507,
  "430,336": 2508,
  "457,283": 2509,
  "1768,1113": 2510,
  "324,1050": 2511,
  "1973,442": 2512,
  "627,100": 2513,
  "2201,107": 2514,
  "118,462": 2515,
  "531,2203": 2516,
  "1168,893": 2517,
  "1452,348": 2518,
  "347,289": 2519,
  "1289,607": 2520,
  "1020,605": 2521,
  "1791,429": 2522,
  "981,607": 2523,
  "1676,414": 2524,
  "925,865": 2525,
  "1224,84": 2526,
  "1051,311": 2527,
  "474,266": 2528,
  "270,83": 2529,
  "899,484": 2530,
  "631,285": 2531,
  "304,101": 2532,
  "341,264": 2533,
  "768,10": 2534,
  "351,1651": 2535,
  "33,34": 2536,
  "84,604": 2537,
  "845,274": 2538,
  "475,305": 2539,
  "34,327": 2540,
  "998,361": 2541,
  "1357,326": 2542,
  "322,527": 2543,
  "714,279": 2544,
  "526,1683": 2545,
  "1969,1401": 2546,
  "1463,615": 2547,
  "109,575": 2548,
  "420,272": 2549,
  "331,109": 2550,
  "416,109": 2551,
  "1052,1408": 2552,
  "316,1236": 2553,
  "2223,1426": 2554,
  "414,1362": 2555,
  "706,2004": 2556,
  "1125,342": 2557,
  "346,429": 2558,
  "115,423": 2559,
  "1830,516": 2560,
  "909,32": 2561,
  "428,32": 2562,
  "572,552": 2563,
  "521,1620": 2564,
  "65,273": 2565,
  "2007,1163": 2566,
  "103,306": 2567,
  "388,262": 2568,
  "1051,351": 2569,
  "262,336": 2570,
  "371,10": 2571,
  "100,261": 2572,
  "391,902": 2573,
  "1369,602": 2574,
  "438,399": 2575,
  "76,1053": 2576,
  "1296,294": 2577,
  "1055,121": 2578,
  "84,97": 2579,
  "680,311": 2580,
  "327,733": 2581,
  "2016,1317": 2582,
  "761,302": 2583,
  "2247,606": 2584,
  "359,73": 2585,
  "283,285": 2586,
  "1056,267": 2587,
  "526,1925": 2588,
  "10,336": 2589,
  "119,261": 2590,
  "296,266": 2591,
  "327,322": 2592,
  "479,289": 2593,
  "341,394": 2594,
  "1578,101": 2595,
  "2595,370": 2596,
  "549,471": 2597,
  "1078,692": 2598,
  "261,755": 2599,
  "475,547": 2600,
  "356,10": 2601,
  "636,99": 2602,
  "443,289": 2603,
  "96,425": 2604,
  "112,286": 2605,
  "1353,866": 2606,
  "122,294": 2607,
  "270,1704": 2608,
  "1127,118": 2609,
  "512,274": 2610,
  "553,101": 2611,
  "499,471": 2612,
  "1046,289": 2613,
  "372,1227": 2614,
  "609,1574": 2615,
  "289,384": 2616,
  "302,620": 2617,
  "577,270": 2618,
  "777,268": 2619,
  "504,1091": 2620,
  "434,268": 2621,
  "106,1212": 2622,
  "592,940": 2623,
  "342,384": 2624,
  "2197,1847": 2625,
  "296,701": 2626,
  "2276,1213": 2627,
  "321,266": 2628,
  "100,406": 2629,
  "296,110": 2630,
  "592,898": 2631,
  "395,83": 2632,
  "673,10": 2633,
  "705,552": 2634,
  "59,267": 2635,
  "1535,274": 2636,
  "109,414": 2637,
  "404,408": 2638,
  "118,286": 2639,
  "2639,518": 2640,
  "86,263": 2641,
  "81,117": 2642,
  "107,335": 2643,
  "1023,10": 2644,
  "399,98": 2645,
  "118,519": 2646,
  "1027,558": 2647,
  "725,444": 2648,
  "10,96": 2649,
  "418,111": 2650,
  "107,1135": 2651,
  "351,1631": 2652,
  "103,456": 2653,
  "357,271": 2654,
  "107,1095": 2655,
  "415,528": 2656,
  "884,294": 2657,
  "680,289": 2658,
  "118,289": 2659,
  "627,320": 2660,
  "793,344": 2661,
  "263,45": 2662,
  "327,96": 2663,
  "396,336": 2664,
  "115,267": 2665,
  "354,464": 2666,
  "415,10": 2667,
  "340,2289": 2668,
  "2668,256": 2669,
  "100,333": 2670,
  "2296,292": 2671,
  "768,302": 2672,
  "73,102": 2673,
  "2301,702": 2674,
  "97,1245": 2675,
  "333,1069": 2676,
  "771,302": 2677,
  "433,1415": 2678,
  "1025,1732": 2679,
  "402,1714": 2680,
  "390,1006": 2681,
  "973,829": 2682,
  "499,364": 2683,
  "69,120": 2684,
  "423,942": 2685,
  "1511,270": 2686,
  "1871,367": 2687,
  "472,717": 2688,
  "302,949": 2689,
  "817,96": 2690,
  "1860,1141": 2691,
  "259,333": 2692,
  "1129,1302": 2693,
  "1185,451": 2694,
  "371,1302": 2695,
  "963,268": 2696,
  "287,731": 2697,
  "100,383": 2698,
  "260,333": 2699,
  "110,1796": 2700,
  "2045,536": 2701,
  "489,1956": 2702,
  "457,121": 2703,
  "994,109": 2704,
  "261,2326": 2705,
  "2705,110": 2706,
  "1024,370": 2707,
  "842,1233": 2708,
  "103,269": 2709,
  "1022,985": 2710,
  "258,269": 2711,
  "809,344": 2712,
  "115,1490": 2713,
  "871,289": 2714,
  "391,121": 2715,
  "896,778": 2716,
  "455,442": 2717,
  "363,270": 2718,
  "366,288": 2719,
  "102,739": 2720,
  "271,482": 2721,
  "349,556": 2722,
  "1700,505": 2723,
  "1875,1987": 2724,
  "1583,289": 2725,
  "592,457": 2726,
  "455,285": 2727,
  "34,322": 2728,
  "516,566": 2729,
  "1582,547": 2730,
  "503,267": 2731,
  "897,339": 2732,
  "1176,107": 2733,
  "2091,44": 2734,
  "2734,714": 2735,
  "403,418": 2736,
  "756,535": 2737,
  "365,2077": 2738,
  "398,1031": 2739,
  "44,761": 2740,
  "1235,1152": 2741,
  "2090,2356": 2742,
  "585,588": 2743,
  "962,742": 2744,
  "1848,1599": 2745,
  "96,1598": 2746,
  "86,727": 2747,
  "1303,932": 2748,
  "510,632": 2749,
  "404,1014": 2750,
  "1349,294": 2751,
  "553,988": 2752,
  "310,1377": 2753,
  "46,1373": 2754,
  "109,646": 2755,
  "1578,653": 2756,
  "555,580": 2757,
  "76,2369": 2758,
  "87,1143": 2759,
  "1879,272": 2760,
  "698,351": 2761,
  "911,45": 2762,
  "696,596": 2763,
  "555,2101": 2764,
  "505,383": 2765,
  "65,76": 2766,
  "73,67": 2767,
  "69,39": 2768,
  "82,69": 2769,
  "339,360": 2770,
  "2379,107": 2771,
  "112,598": 2772,
  "98,716": 2773,
  "887,385": 2774,
  "105,294": 2775,
  "470,570": 2776,
  "413,870": 2777,
  "539,308": 2778,
  "627,267": 2779,
  "795,101": 2780,
  "780,40": 2781,
  "1612,602": 2782,
  "593,308": 2783,
  "415,599": 2784,
  "1068,256": 2785,
  "948,285": 2786,
  "70,32": 2787,
  "45,10": 2788,
  "325,1315": 2789,
  "396,1140": 2790,
  "98,629": 2791,
  "1317,397": 2792,
  "2792,307": 2793,
  "1508,457": 2794,
  "2794,329": 2795,
  "1898,318": 2796,
  "340,1256": 2797,
  "1251,407": 2798,
  "266,1609": 2799,
  "360,466": 2800,
  "1416,340": 2801,
  "630,295": 2802,
  "875,361": 2803,
  "1072,571": 2804,
  "889,616": 2805,
  "503,535": 2806,
  "102,487": 2807,
  "311,345": 2808,
  "116,716": 2809,
  "1001,360": 2810,
  "891,316": 2811,
  "99,355": 2812,
  "951,493": 2813,
  "104,671": 2814,
  "432,918": 2815,
  "505,267": 2816,
  "443,820": 2817,
  "1100,280": 2818,
  "270,436": 2819,
  "752,334": 2820,
  "78,69": 2821,
  "470,329": 2822,
  "1617,361": 2823,
  "783,1261": 2824,
  "350,271": 2825,
  "497,305": 2826,
  "951,848": 2827,
  "737,273": 2828,
  "115,2410": 2829,
  "360,476": 2830,
  "427,292": 2831,
  "669,10": 2832,
  "499,116": 2833,
  "1318,779": 2834,
  "1628,327": 2835,
  "121,294": 2836,
  "288,1212": 2837,
  "256,353": 2838,
  "110,1629": 2839,
  "285,288": 2840,
  "432,425": 2841,
  "115,632": 2842,
  "710,1099": 2843,
  "690,267": 2844,
  "644,1632": 2845,
  "1190,71": 2846,
  "1427,296": 2847,
  "736,2136": 2848,
  "463,2417": 2849,
  "1103,1912": 2850,
  "600,411": 2851,
  "330,45": 2852,
  "1100,257": 2853,
  "97,786": 2854,
  "1068,101": 2855,
  "526,831": 2856,
  "329,2425": 2857,
  "426,337": 2858,
  "325,400": 2859,
  "2429,302": 2860,
  "1526,311": 2861,
  "1922,631": 2862,
  "261,493": 2863,
  "108,506": 2864,
  "108,1639": 2865,
  "2438,256": 2866,
  "377,316": 2867,
  "2148,1141": 2868,
  "273,421": 2869,
  "372,115": 2870,
  "256,316": 2871,
  "305,609": 2872,
  "2154,1113": 2873,
  "270,500": 2874,
  "570,1337": 2875,
  "260,1929": 2876,
  "98,1005": 2877,
  "102,819": 2878,
  "115,319": 2879,
  "475,294": 2880,
  "2880,99": 2881,
  "2881,581": 2882,
  "45,2459": 2883,
  "1934,105": 2884,
  "486,655": 2885,
  "1921,388": 2886,
  "1155,407": 2887,
  "771,267": 2888,
  "1118,343": 2889,
  "529,267": 2890,
  "403,349": 2891,
  "115,386": 2892,
  "424,107": 2893,
  "560,296": 2894,
  "283,10": 2895,
  "662,445": 2896,
  "703,328": 2897,
  "110,383": 2898,
  "99,646": 2899,
  "563,322": 2900,
  "987,311": 2901,
  "2476,294": 2902,
  "2478,439": 2903,
  "1077,10": 2904,
  "783,1947": 2905,
  "792,272": 2906,
  "289,617": 2907,
  "588,858": 2908,
  "636,261": 2909,
  "116,846": 2910,
  "98,558": 2911,
  "1013,403": 2912,
  "1797,436": 2913,
  "513,370": 2914,
  "884,101": 2915,
  "385,1047": 2916,
  "404,109": 2917,
  "530,494": 2918,
  "102,269": 2919,
  "357,369": 2920,
  "308,849": 2921,
  "1080,311": 2922,
  "1341,267": 2923,
  "270,1015": 2924,
  "2491,261": 2925,
  "101,44": 2926,
  "682,336": 2927,
  "440,112": 2928,
  "2928,481": 2929,
